{"audio_title": "2024 NLP International Conference [RBqf25pbVZ0].mp3", "audio_text": " Welcome to the 2024 NLP International Conference taking place both virtually and at the Sheraton Skyline Hotel in Heathrow. We are so excited to be doing a pre-conference visit at the Sheraton Skyline here in Heathrow and this is our venue space for next year and this is where we will be holding all the drinks and social and community elements of the conference. We have a fantastic lineup for the in-person element of the conference which is taking place on the 11th and 12th of May 2024 including our amazing masterclass presenters Penny Tompkins and James Lawley and an array of other amazing presenters who will be delivering their presentations on the Sunday. In the Change to our 2023 event our virtual weekend in 2024 will be held on the 10th and 11th of February with multiple streams running simultaneously and again an amazing array of presenters over the two days. We also have a superb lineup of exhibitors who you will be able to meet at both the virtual and in-person parts of the conference. Of course feedback is really important so rather than listen to what we have to say how about hearing from some of the other delegates from the 2023 event? The whole event has run beautifully and I have learned so much and I always loved the fact that you know you put away with so much. I wanted to connect and hug everyone. I'm a real hugger. You are. And yeah I just think it's really nice to be back in the room with everyone. It's wonderful isn't it? Just getting that real energy back in the connection. Honestly I'm really enjoying it. The energy is so lovely, everybody's so supported. So we are so looking forward to seeing you here next May 2024 for the NLP International Conference.", "segments": [{"timestamp": "0.48 - 8.08", "text": " Welcome to the 2024 NLP International Conference taking place both virtually"}, {"timestamp": "8.08 - 15.84", "text": " and at the Sheraton Skyline Hotel in Heathrow. We are so excited to be doing a pre-conference visit"}, {"timestamp": "15.84 - 22.64", "text": " at the Sheraton Skyline here in Heathrow and this is our venue space for next year and this"}, {"timestamp": "23.6 - 29.52", "text": " is where we will be holding all the drinks and social and community elements of the conference."}, {"timestamp": "30.16 - 35.36", "text": " We have a fantastic lineup for the in-person element of the conference which is taking"}, {"timestamp": "35.36 - 42.480000000000004", "text": " place on the 11th and 12th of May 2024 including our amazing masterclass presenters"}, {"timestamp": "42.480000000000004 - 49.84", "text": " Penny Tompkins and James Lawley and an array of other amazing presenters who will be delivering"}, {"timestamp": "49.84 - 57.760000000000005", "text": " their presentations on the Sunday. In the Change to our 2023 event our virtual weekend in 2024"}, {"timestamp": "57.76 - 63.519999999999996", "text": " will be held on the 10th and 11th of February with multiple streams running simultaneously"}, {"timestamp": "63.519999999999996 - 72.4", "text": " and again an amazing array of presenters over the two days. We also have a superb lineup of exhibitors"}, {"timestamp": "72.4 - 77.12", "text": " who you will be able to meet at both the virtual and in-person parts of the conference."}, {"timestamp": "78.24 - 83.28", "text": " Of course feedback is really important so rather than listen to what we have to say"}, {"timestamp": "83.28 - 87.68", "text": " how about hearing from some of the other delegates from the 2023 event?"}, {"timestamp": "87.68 - 94.48", "text": " The whole event has run beautifully and I have learned so much and I always loved the fact that"}, {"timestamp": "94.48 - 98.0", "text": " you know you put away with so much. I wanted to connect and hug everyone."}, {"timestamp": "98.0 - 105.68", "text": " I'm a real hugger. You are. And yeah I just think it's really nice to be back in the room with everyone."}, {"timestamp": "105.68 - 109.44", "text": " It's wonderful isn't it? Just getting that real energy back in the connection."}, {"timestamp": "109.44 - 115.52", "text": " Honestly I'm really enjoying it. The energy is so lovely, everybody's so supported."}, {"timestamp": "115.52 - 131.84", "text": " So we are so looking forward to seeing you here next May 2024 for the NLP International Conference."}]}
{"audio_title": "NLP International Events 2025 & 2026 - Programme Launch [068nfPdtssI].mp3", "audio_text": " We are so excited to be launching the 2025 Masterclasses and the start of the 2026 conference. So we've got new presenters this year including Suren Kolkankar, Ezaya Gibbons and Nikki Emerton. We've got some favourites back and confirmed for 2026 conference are Michael Hall, Sue Knight and a beautiful combination of Nishit Shah and Judith Lowe. We've got fresh, innovative new topics for you over the next couple of years, including the Grounded Model from Joanna Harper, emotional identity techniques and living life in 4D. And of course, this all starts in February 2025 with Richard Bolstad presenting a six hour masterclass on the creation cycle. So, how do you access all these fresh, innovative and new presentations? You can choose individual masterclasses and just cherry pick those that you want. You can save money by opting for the masterclass collection. And if you're intending to come to the conference in person in 2026, then that is by far the best option because included in your conference ticket are all the masterclasses for 2025 and 2026. You can even spread the cost of your conference ticket if you apply before the 31st of December. And in case you're interested, here's some feedback from the 2024 conference. I have had the best time. So to take a weekend out of your week when you're really busy on the Facebook seems like a lot. But I'm so glad I've come to this conference. I've met so many amazing people. And when I heard Karen say that next year there's going to be 10 masterclasses, so you get to go to one like every month for 10 months, it'll really help embed that learning and keep connected. So much content, so many great people, wonderful presenters. I can't wait to catch up with all the videos of the ones I haven't been able to get to in person. So yeah, thanks ANLP, another roaring success from my point of view. So with so many options available to you, which one are you going to choose? Visit the website, go to upcoming events and choose whichever options you want to go for. And remember the festivals too, in 2024 and in 2025. We really look forward to welcoming you to one of our events over the next couple of years.", "segments": [{"timestamp": "0.0 - 11.0", "text": " We are so excited to be launching the 2025 Masterclasses and the start of the 2026 conference."}, {"timestamp": "11.0 - 20.0", "text": " So we've got new presenters this year including Suren Kolkankar, Ezaya Gibbons and Nikki Emerton."}, {"timestamp": "20.0 - 27.0", "text": " We've got some favourites back and confirmed for 2026 conference are Michael Hall, Sue Knight"}, {"timestamp": "27.0 - 31.0", "text": " and a beautiful combination of Nishit Shah and Judith Lowe."}, {"timestamp": "31.0 - 40.0", "text": " We've got fresh, innovative new topics for you over the next couple of years, including the Grounded Model from Joanna Harper,"}, {"timestamp": "40.0 - 45.0", "text": " emotional identity techniques and living life in 4D."}, {"timestamp": "45.0 - 56.0", "text": " And of course, this all starts in February 2025 with Richard Bolstad presenting a six hour masterclass on the creation cycle."}, {"timestamp": "56.0 - 61.0", "text": " So, how do you access all these fresh, innovative and new presentations?"}, {"timestamp": "61.0 - 66.0", "text": " You can choose individual masterclasses and just cherry pick those that you want."}, {"timestamp": "66.0 - 70.0", "text": " You can save money by opting for the masterclass collection."}, {"timestamp": "70.0 - 77.0", "text": " And if you're intending to come to the conference in person in 2026, then that is by far the best option"}, {"timestamp": "77.0 - 86.0", "text": " because included in your conference ticket are all the masterclasses for 2025 and 2026."}, {"timestamp": "86.0 - 92.0", "text": " You can even spread the cost of your conference ticket if you apply before the 31st of December."}, {"timestamp": "92.0 - 97.0", "text": " And in case you're interested, here's some feedback from the 2024 conference."}, {"timestamp": "97.0 - 106.0", "text": " I have had the best time. So to take a weekend out of your week when you're really busy on the Facebook seems like a lot."}, {"timestamp": "106.0 - 110.0", "text": " But I'm so glad I've come to this conference. I've met so many amazing people."}, {"timestamp": "110.0 - 117.0", "text": " And when I heard Karen say that next year there's going to be 10 masterclasses, so you get to go to one like every month for 10 months,"}, {"timestamp": "117.0 - 120.0", "text": " it'll really help embed that learning and keep connected."}, {"timestamp": "120.0 - 124.0", "text": " So much content, so many great people, wonderful presenters."}, {"timestamp": "124.0 - 128.0", "text": " I can't wait to catch up with all the videos of the ones I haven't been able to get to in person."}, {"timestamp": "128.0 - 133.0", "text": " So yeah, thanks ANLP, another roaring success from my point of view."}, {"timestamp": "133.0 - 138.0", "text": " So with so many options available to you, which one are you going to choose?"}, {"timestamp": "138.0 - 145.0", "text": " Visit the website, go to upcoming events and choose whichever options you want to go for."}, {"timestamp": "145.0 - 151.0", "text": " And remember the festivals too, in 2024 and in 2025."}, {"timestamp": "151.0 - 156.0", "text": " We really look forward to welcoming you to one of our events over the next couple of years."}]}
{"audio_title": "2022 Virtual NLP International Conference - Tania Prince - Session Taster Video [fyDY3e0HNO8].mp3", "audio_text": " Tanya Prince, I am an NLP trainer, EFT founding master and trainer, and also the developer of an approach called mindfulness-based inner repatterning. What is mindfulness-based inner repatterning? It is a very simple therapeutic approach that works in alignment with how our body's function. Mindfulness-based inner repatterning does not require that we do a lot of talking around the issues that we have, neither does it require that we analyze and understand what's going on. What it does is one very simple thing. It puts us into a reboot mode, and whilst in the reboot mode, we actually bring awareness and attention to the problem we're experiencing and set the intention for our systems to process that out. Another word for that would be heal it. In other words, to bring us into a better state of being. At the conference, I'm going to be dealing with a specific part of the approach, which is a parts model. My presentation will be called a new simple and effective model for working with parts. This is a very different way than the traditional way we work with parts in NLP. So it is kind of an ABCD thing, and I do find that people absolutely love this model. It's probably not what they expect at the beginning. They don't generally expect we'll go down the route that we go down, but it is very, very interesting. So what will you learn at my presentation? You'll learn a very different way for working with parts that you can bring into your own therapeutic practice. A very simple way that generally people absolutely love it because there's a gentleness with it. And I think it works, you know, very beautifully with how we've been brought up and very nurturing way of working with parts. So I look forward to seeing you at my presentation at the NLP International Conference in Maine.", "segments": [{"timestamp": "0.0 - 14.8", "text": " Tanya Prince, I am an NLP trainer, EFT founding master and trainer, and also the developer"}, {"timestamp": "14.8 - 21.52", "text": " of an approach called mindfulness-based inner repatterning. What is mindfulness-based inner"}, {"timestamp": "21.52 - 28.64", "text": " repatterning? It is a very simple therapeutic approach that works in alignment with how our"}, {"timestamp": "28.64 - 37.8", "text": " body's function. Mindfulness-based inner repatterning does not require that we do a lot of talking around"}, {"timestamp": "37.8 - 44.58", "text": " the issues that we have, neither does it require that we analyze and understand what's going on."}, {"timestamp": "45.5 - 55.2", "text": " What it does is one very simple thing. It puts us into a reboot mode, and whilst in the reboot mode,"}, {"timestamp": "55.2 - 61.14", "text": " we actually bring awareness and attention to the problem we're experiencing and set the intention"}, {"timestamp": "61.14 - 68.68", "text": " for our systems to process that out. Another word for that would be heal it. In other words,"}, {"timestamp": "68.74000000000001 - 75.56", "text": " to bring us into a better state of being. At the conference, I'm going to be dealing with a specific"}, {"timestamp": "75.56 - 83.24000000000001", "text": " part of the approach, which is a parts model. My presentation will be called a new simple and"}, {"timestamp": "83.24 - 90.03999999999999", "text": " effective model for working with parts. This is a very different way than the traditional way we"}, {"timestamp": "90.03999999999999 - 99.24", "text": " work with parts in NLP. So it is kind of an ABCD thing, and I do find that people absolutely love"}, {"timestamp": "99.24 - 104.78", "text": " this model. It's probably not what they expect at the beginning. They don't generally expect we'll go"}, {"timestamp": "104.78 - 110.3", "text": " down the route that we go down, but it is very, very interesting. So what will you learn at my"}, {"timestamp": "110.3 - 118.8", "text": " presentation? You'll learn a very different way for working with parts that you can bring into your"}, {"timestamp": "118.8 - 126.8", "text": " own therapeutic practice. A very simple way that generally people absolutely love it because there's"}, {"timestamp": "126.8 - 134.06", "text": " a gentleness with it. And I think it works, you know, very beautifully with how we've been brought up"}, {"timestamp": "134.06 - 142.94", "text": " and very nurturing way of working with parts. So I look forward to seeing you at my presentation at the"}, {"timestamp": "142.94 - 145.82", "text": " NLP International Conference in Maine."}]}
{"audio_title": "2023 NLP International Conference - Shelle Rose Charvet - Session Taster Video [yie3aGoyZl0].mp3", "audio_text": " Hi, I'm Shelley Rose Charvet, and I'm delighted to be coming on Sunday morning at the NLP conference to do an interactive workshop on coaching techniques. Are you ready to gear up your coaching and perhaps your psychotherapy with techniques that you can use that will really help you understand your clients and have a bigger impact and have them go away understanding what they've learned and the progress they've made. So, like, for example, how do you know what meta programs had to be meta programs with me what lab profile patterns or meta programs. Do your clients have when they're in a stuck state? What is a typical combination patterns they have when they're stuck? And what do you need to do about it? What are the conversational techniques? We're going to be looking at some of my newest experiments and you're going to get a chance to try them out with yourself and with a partner and give feedback on them. We also want to hear from you about what your techniques are. What have you learned? What are the hacks you've learned over the years that you've been working with people? So this is an advanced workshop. We're assuming or I'm assuming since I'm the one leading it that you know about NLP and you've had some experience or a lot of experience in working with clients. So we're going to be looking at some spatial things, some verbal things all around techniques. And the idea is that we do some training. We actually practice and do feedback. So you're going to get a chance to be the subject and the intervener. Is that a word? Intervener, facilitator, coach, therapist, whatever it is. And we're going to laugh a lot and get a lot of energy. So some of the exercises will be done sitting down and some standing up if you can do that. So I really look forward to seeing you for 90 minutes of fast paced learning that are really going to hone your coaching skills verbally, non-verbally and spatially looking forward to it. See you there.", "segments": [{"timestamp": "0.0 - 12.0", "text": " Hi, I'm Shelley Rose Charvet, and I'm delighted to be coming on Sunday morning at the NLP"}, {"timestamp": "12.0 - 17.52", "text": " conference to do an interactive workshop on coaching techniques."}, {"timestamp": "17.52 - 22.92", "text": " Are you ready to gear up your coaching and perhaps your psychotherapy with techniques"}, {"timestamp": "22.92 - 27.400000000000002", "text": " that you can use that will really help you understand your clients and have a bigger"}, {"timestamp": "27.4 - 33.4", "text": " impact and have them go away understanding what they've learned and the progress they've"}, {"timestamp": "33.4 - 34.4", "text": " made."}, {"timestamp": "34.4 - 39.12", "text": " So, like, for example, how do you know what meta programs had to be meta programs with me what"}, {"timestamp": "39.12 - 42.46", "text": " lab profile patterns or meta programs."}, {"timestamp": "42.46 - 47.28", "text": " Do your clients have when they're in a stuck state?"}, {"timestamp": "47.28 - 51.34", "text": " What is a typical combination patterns they have when they're stuck?"}, {"timestamp": "51.34 - 52.76", "text": " And what do you need to do about it?"}, {"timestamp": "52.76 - 54.68", "text": " What are the conversational techniques?"}, {"timestamp": "54.68 - 60.32", "text": " We're going to be looking at some of my newest experiments and you're going to get a chance"}, {"timestamp": "60.32 - 64.58", "text": " to try them out with yourself and with a partner and give feedback on them."}, {"timestamp": "64.58 - 67.94", "text": " We also want to hear from you about what your techniques are."}, {"timestamp": "67.94 - 68.94", "text": " What have you learned?"}, {"timestamp": "68.94 - 72.66", "text": " What are the hacks you've learned over the years that you've been working with people?"}, {"timestamp": "72.66 - 74.68", "text": " So this is an advanced workshop."}, {"timestamp": "74.68 - 80.08", "text": " We're assuming or I'm assuming since I'm the one leading it that you know about NLP and you've"}, {"timestamp": "80.08 - 86.84", "text": " had some experience or a lot of experience in working with clients."}, {"timestamp": "86.84 - 93.52", "text": " So we're going to be looking at some spatial things, some verbal things all around techniques."}, {"timestamp": "93.52 - 96.2", "text": " And the idea is that we do some training."}, {"timestamp": "96.2 - 97.72", "text": " We actually practice and do feedback."}, {"timestamp": "97.72 - 102.36", "text": " So you're going to get a chance to be the subject and the intervener."}, {"timestamp": "102.36 - 103.36", "text": " Is that a word?"}, {"timestamp": "103.36 - 106.78", "text": " Intervener, facilitator, coach, therapist, whatever it is."}, {"timestamp": "106.78 - 110.06", "text": " And we're going to laugh a lot and get a lot of energy."}, {"timestamp": "110.06 - 115.08", "text": " So some of the exercises will be done sitting down and some standing up if you can do that."}, {"timestamp": "115.08 - 121.3", "text": " So I really look forward to seeing you for 90 minutes of fast paced learning that are really"}, {"timestamp": "121.3 - 127.86", "text": " going to hone your coaching skills verbally, non-verbally and spatially looking forward to it."}, {"timestamp": "127.86 - 128.85999999999999", "text": " See you there."}]}
{"audio_title": "2023 NLP International Conference - Fiona Campbell - Session Taster Video [EKT-kUnwSkk].mp3", "audio_text": " Are you aware that over 73% of people have a fear of speaking in public or giving presentations? Now that's one of the biggest, the biggest fear that people have globally. But it's the biggest fear that holds people back in business. Because as a business leader, a business professional, an NLP professional and a coach, you have to be able to stand up there and talk about your business and present yourself. My name is Fiona Campbell and I've been working with NLP for over 30 years, specifically for business and coaching. Now, I've worked with thousands of business clients to help them gain more confidence when they're presenting. You can say, I've seen many, many people that have been sent to presentation courses and they get taken through the structure of presenting and yet they still can't present. And the reason for that is presenting comes from within. You can be taught how to stand, how to give eye contact, how to work with PowerPoints, how to look at the audience. But if you're not comfortable in the inside, then that is going to show. We've got an incredible range of NLP techniques that can help you really connect with your audience. Because good presenting is all about connecting with the heart of someone. Helping someone really take in information, help them feel as if you care about them. One of the things that I have noticed with many of the people, in fact, most of the people that I've worked with presenting, is the pictures they make in their head. They forget to take themselves to the end of the presentation. What they do is they create this visual submodality in their head, this picture in their head, and then they normally freeze frame it at the scariest parts. So then when they're thinking about presenting, all they get is this big scary image that comes up. Guess what? When you can take someone in their mind to the end of the presentation and complete that presentation successfully for them, that's you well on the way to helping someone present well. That's only one of the techniques we're going to use. In this workshop I've put together, I'm going to be showing you lots of different ways that you can use your NLP skills to either work with yourself or maybe even the clients you're working for. This works. NLP skills are so powerful for helping people change the way they present themselves and take them very quickly from maybe being terrified of presenting to going, I'm confident about this. Now, of course, people have to practice. There's going to be, there's a lot of practical elements behind presenting in public speaking, but I'll take you through that in the workshop. So my name is Fiona Campbell. I look forward to seeing you soon. And you'll be learning loads of stuff about how this works for public speaking and for presenting.", "segments": [{"timestamp": "0.0 - 11.4", "text": " Are you aware that over 73% of people have a fear of speaking in public or giving presentations?"}, {"timestamp": "12.18 - 15.8", "text": " Now that's one of the biggest, the biggest fear that people have globally."}, {"timestamp": "16.36 - 20.22", "text": " But it's the biggest fear that holds people back in business."}, {"timestamp": "20.740000000000002 - 26.060000000000002", "text": " Because as a business leader, a business professional, an NLP professional and a coach,"}, {"timestamp": "26.06 - 31.259999999999998", "text": " you have to be able to stand up there and talk about your business and present yourself."}, {"timestamp": "31.82 - 36.04", "text": " My name is Fiona Campbell and I've been working with NLP for over 30 years,"}, {"timestamp": "36.42 - 38.519999999999996", "text": " specifically for business and coaching."}, {"timestamp": "39.28 - 45.5", "text": " Now, I've worked with thousands of business clients to help them gain more confidence when they're presenting."}, {"timestamp": "46.04 - 50.120000000000005", "text": " You can say, I've seen many, many people that have been sent to presentation courses"}, {"timestamp": "50.120000000000005 - 54.8", "text": " and they get taken through the structure of presenting"}, {"timestamp": "54.8 - 56.9", "text": " and yet they still can't present."}, {"timestamp": "57.82 - 62.019999999999996", "text": " And the reason for that is presenting comes from within."}, {"timestamp": "62.72 - 65.94", "text": " You can be taught how to stand, how to give eye contact,"}, {"timestamp": "66.44 - 70.24", "text": " how to work with PowerPoints, how to look at the audience."}, {"timestamp": "70.8 - 75.88", "text": " But if you're not comfortable in the inside, then that is going to show."}, {"timestamp": "76.96 - 82.47999999999999", "text": " We've got an incredible range of NLP techniques that can help you really connect with your audience."}, {"timestamp": "82.48 - 86.46000000000001", "text": " Because good presenting is all about connecting with the heart of someone."}, {"timestamp": "86.98 - 92.80000000000001", "text": " Helping someone really take in information, help them feel as if you care about them."}, {"timestamp": "93.18 - 97.02000000000001", "text": " One of the things that I have noticed with many of the people,"}, {"timestamp": "97.12 - 100.12", "text": " in fact, most of the people that I've worked with presenting,"}, {"timestamp": "100.66 - 103.44", "text": " is the pictures they make in their head."}, {"timestamp": "103.44 - 107.72", "text": " They forget to take themselves to the end of the presentation."}, {"timestamp": "108.24 - 112.58", "text": " What they do is they create this visual submodality in their head,"}, {"timestamp": "112.66 - 118.0", "text": " this picture in their head, and then they normally freeze frame it at the scariest parts."}, {"timestamp": "118.67999999999999 - 121.16", "text": " So then when they're thinking about presenting,"}, {"timestamp": "121.32 - 124.16", "text": " all they get is this big scary image that comes up."}, {"timestamp": "124.97999999999999 - 125.68", "text": " Guess what?"}, {"timestamp": "125.68 - 129.28", "text": " When you can take someone in their mind to the end of the presentation"}, {"timestamp": "129.28 - 133.14000000000001", "text": " and complete that presentation successfully for them,"}, {"timestamp": "133.48000000000002 - 136.64000000000001", "text": " that's you well on the way to helping someone present well."}, {"timestamp": "137.16 - 139.94", "text": " That's only one of the techniques we're going to use."}, {"timestamp": "140.4 - 142.26000000000002", "text": " In this workshop I've put together,"}, {"timestamp": "142.52 - 146.88", "text": " I'm going to be showing you lots of different ways that you can use your NLP skills"}, {"timestamp": "146.88 - 151.52", "text": " to either work with yourself or maybe even the clients you're working for."}, {"timestamp": "151.52 - 153.52", "text": " This works."}, {"timestamp": "153.76000000000002 - 159.70000000000002", "text": " NLP skills are so powerful for helping people change the way they present themselves"}, {"timestamp": "159.70000000000002 - 164.06", "text": " and take them very quickly from maybe being terrified of presenting"}, {"timestamp": "164.06 - 166.5", "text": " to going, I'm confident about this."}, {"timestamp": "166.92000000000002 - 169.34", "text": " Now, of course, people have to practice."}, {"timestamp": "169.92000000000002 - 172.20000000000002", "text": " There's going to be, there's a lot of practical elements"}, {"timestamp": "172.20000000000002 - 174.44", "text": " behind presenting in public speaking,"}, {"timestamp": "174.78 - 176.5", "text": " but I'll take you through that in the workshop."}, {"timestamp": "177.10000000000002 - 178.60000000000002", "text": " So my name is Fiona Campbell."}, {"timestamp": "178.76000000000002 - 180.46", "text": " I look forward to seeing you soon."}, {"timestamp": "180.46 - 184.96", "text": " And you'll be learning loads of stuff about how this works"}, {"timestamp": "184.96 - 188.10000000000002", "text": " for public speaking and for presenting."}]}
{"audio_title": "2023 NLP International Conference - Jan Cisek & Susan Norman - Session Taster Video [Im_dZRpALLA].mp3", "audio_text": " My name is Jan Ciszek. I'm an NLP Master Practitioner and passionate about speed reading and helping you to get on top of your reading and learn faster and smarter. I've been teaching speed reading for more than 22 years, especially for personal development, students and business professionals. And with Susan Norman, I'm also the co-author of the Speed Reading Bible. Hello, I'm Susan Norman. I'm also an NLP Master Practitioner. I'm the author of more than 40 books, including In Your Hands, NLP for Language Learning. I'm an expert in accelerated learning, especially as it applies to language learning and speed reading. During our session at the NLP conference, we're going to introduce the basic concepts of speed reading, techniques and strategies to help you read more efficiently and more effectively. You'll be putting some of these into practice then and there. And our aim is that you'll at least double your reading speed and have many other strategies that you can apply to your reading thereafter. Some of the techniques that you're going to learn, if you're already an NLP practitioner, you probably already know, such as the outcome, purpose, state, also reframing, and all done in the context of accelerated learning and speed reading. So you're going to learn how to transfer your existing skills into speed reading. Although speed reading, as the name suggests, is about speed, it's also about the quality and volume of information. Some techniques are about speeding up your reading and some about reading more. You're going to read more, you're going to remember more, and you're going to be more successful. As some studies suggest that speed readers are successful because they get information, knowledge, and wisdom faster. We'll provide material for you to read, so all you need to do is turn up. We look forward to seeing you there. par plan. I'll show you there. These 1991s are just given what you've prepared for. I'll show you there. All yes, so I intend to take your reading map, so I fall in. Miss the first psychologist is gonna take a video up and start. This is my video. So at the Hopkins Center.", "segments": [{"timestamp": "0.0 - 16.14", "text": " My name is Jan Ciszek."}, {"timestamp": "16.14 - 21.94", "text": " I'm an NLP Master Practitioner and passionate about speed reading and helping you to get"}, {"timestamp": "21.94 - 25.66", "text": " on top of your reading and learn faster and smarter."}, {"timestamp": "25.66 - 31.38", "text": " I've been teaching speed reading for more than 22 years, especially for personal development,"}, {"timestamp": "31.38 - 33.88", "text": " students and business professionals."}, {"timestamp": "33.88 - 38.42", "text": " And with Susan Norman, I'm also the co-author of the Speed Reading Bible."}, {"timestamp": "38.42 - 41.7", "text": " Hello, I'm Susan Norman."}, {"timestamp": "41.7 - 44.6", "text": " I'm also an NLP Master Practitioner."}, {"timestamp": "44.6 - 51.72", "text": " I'm the author of more than 40 books, including In Your Hands, NLP for Language Learning."}, {"timestamp": "51.72 - 57.66", "text": " I'm an expert in accelerated learning, especially as it applies to language learning and speed"}, {"timestamp": "57.66 - 59.82", "text": " reading."}, {"timestamp": "59.82 - 64.5", "text": " During our session at the NLP conference, we're going to introduce the basic concepts of speed"}, {"timestamp": "64.5 - 71.08", "text": " reading, techniques and strategies to help you read more efficiently and more effectively."}, {"timestamp": "71.08 - 74.22", "text": " You'll be putting some of these into practice then and there."}, {"timestamp": "74.22 - 80.67999999999999", "text": " And our aim is that you'll at least double your reading speed and have many other strategies"}, {"timestamp": "80.67999999999999 - 85.02", "text": " that you can apply to your reading thereafter."}, {"timestamp": "85.02 - 90.4", "text": " Some of the techniques that you're going to learn, if you're already an NLP practitioner,"}, {"timestamp": "90.4 - 96.74", "text": " you probably already know, such as the outcome, purpose, state, also reframing, and all done"}, {"timestamp": "96.74 - 100.14", "text": " in the context of accelerated learning and speed reading."}, {"timestamp": "100.14 - 105.06", "text": " So you're going to learn how to transfer your existing skills into speed reading."}, {"timestamp": "105.06 - 109.11999999999999", "text": " Although speed reading, as the name suggests, is about speed, it's also about the quality"}, {"timestamp": "109.11999999999999 - 111.61999999999999", "text": " and volume of information."}, {"timestamp": "111.61999999999999 - 115.66", "text": " Some techniques are about speeding up your reading and some about reading more."}, {"timestamp": "115.66 - 119.06", "text": " You're going to read more, you're going to remember more, and you're going to be more"}, {"timestamp": "119.06 - 120.06", "text": " successful."}, {"timestamp": "120.06 - 126.67999999999999", "text": " As some studies suggest that speed readers are successful because they get information, knowledge,"}, {"timestamp": "126.68 - 128.68", "text": " and wisdom faster."}, {"timestamp": "128.68 - 136.82", "text": " We'll provide material for you to read, so all you need to do is turn up."}, {"timestamp": "136.82 - 138.06", "text": " We look forward to seeing you there."}, {"timestamp": "156.68 - 161.32", "text": " par plan."}, {"timestamp": "161.32 - 164.32", "text": " I'll show you there."}, {"timestamp": "164.32 - 166.6", "text": " These 1991s are just given what you've prepared for."}, {"timestamp": "166.6 - 168.64000000000001", "text": " I'll show you there."}, {"timestamp": "168.64000000000001 - 173.78", "text": " All yes, so I intend to take your reading map, so I fall in."}, {"timestamp": "173.96 - 180.88", "text": " Miss the first psychologist is gonna take a video up and start."}, {"timestamp": "180.88 - 181.36", "text": " This is my video."}, {"timestamp": "181.56 - 183.74", "text": " So at the Hopkins Center."}]}
{"audio_title": "2023 NLP International Conference - Nathalie Lebas - Session Taster Video [CgaLnNtJGTs].mp3", "audio_text": " Everything is movement. The movement of our bodies, the movement of our lives, the movement within us and that of the earth around us. There are many ways to move and each human being is unique. You are unique in your own body, in your own expression of yourself. Each human being has its own energy and with generative NLP and somatic mind, we can live a journey of self-discovery to be the change you want to see in the world professionally or personally. As a dancer, I have developed a method which I call Generative Somatic Movement to help people to connect deeply to themselves, to their body, to each part of their body, to embody the change they want to live in the world. I am Nathalie Lebas. I'm French, you can hear with my accent. I'm the manager of a generative training, coaching and consulting company. I work in the world of business as well as the world of personal development. As an NLP master trainer, trained by the best teachers in the world, Robert Dills, Judith Delosier, Susie Smith, Chris and Tim Album, Judith Lowe, Robbie Steinhaus and Stephen Gilligan and others, I have created a Generative NLP and Somatic Mind Institute in France. In this highly cognitive and constantly changing world, everyone may feel the need to come back to basic, to come back home, to come back to themselves. And this somatic practice, this is about body movement, enables you to connect to all parts of your body, to your emotions and to bring awareness to everything you feel, to calm the nervous system down and to move forward in a more confident way towards your authentic being, your identity and your desired state. Thank you. In this masterclass, you will learn that the transformation process begins with centering and reconnecting with yourself, with your body by bringing all the curiosity necessary through movement and mindfulness. Through an exploration of your body, through movement, NLP skills and music, you will find new possibilities of being present to yourself and all worlds. I will guide you on a journey to enter in the realm of NLP Somatic Universe, to rediscover your body, its wellness, in its ability to move, to open new expression of yourself, in order to move forward in the world. It's a journey of self-discovery, of your own hero's journey at your own pace. I am an awakener of people's dreams and I love it. Be careful. My presentation will include generative NLP, some movements with music, the importance of somatic mind and how it can change your internal and external world. So, are you ready to move and reconnect yourself to your body? I wish to have the chance to see you at the NLP International Council. Bye-bye NLP community!", "segments": [{"timestamp": "0.0 - 6.0", "text": " Everything is movement."}, {"timestamp": "6.0 - 13.0", "text": " The movement of our bodies, the movement of our lives, the movement within us and that of the earth around us."}, {"timestamp": "13.0 - 17.0", "text": " There are many ways to move and each human being is unique."}, {"timestamp": "17.0 - 22.0", "text": " You are unique in your own body, in your own expression of yourself."}, {"timestamp": "22.0 - 28.0", "text": " Each human being has its own energy and with generative NLP and somatic mind,"}, {"timestamp": "28.0 - 35.0", "text": " we can live a journey of self-discovery to be the change you want to see in the world professionally or personally."}, {"timestamp": "35.0 - 40.0", "text": " As a dancer, I have developed a method which I call Generative Somatic Movement"}, {"timestamp": "40.0 - 45.0", "text": " to help people to connect deeply to themselves, to their body, to each part of their body,"}, {"timestamp": "45.0 - 48.0", "text": " to embody the change they want to live in the world."}, {"timestamp": "48.0 - 52.0", "text": " I am Nathalie Lebas. I'm French, you can hear with my accent."}, {"timestamp": "52.0 - 56.0", "text": " I'm the manager of a generative training, coaching and consulting company."}, {"timestamp": "56.0 - 61.0", "text": " I work in the world of business as well as the world of personal development."}, {"timestamp": "61.0 - 67.0", "text": " As an NLP master trainer, trained by the best teachers in the world, Robert Dills, Judith Delosier,"}, {"timestamp": "67.0 - 73.0", "text": " Susie Smith, Chris and Tim Album, Judith Lowe, Robbie Steinhaus and Stephen Gilligan and others,"}, {"timestamp": "73.0 - 78.0", "text": " I have created a Generative NLP and Somatic Mind Institute in France."}, {"timestamp": "78.0 - 84.0", "text": " In this highly cognitive and constantly changing world, everyone may feel the need to come back to basic,"}, {"timestamp": "84.0 - 87.0", "text": " to come back home, to come back to themselves."}, {"timestamp": "87.0 - 94.0", "text": " And this somatic practice, this is about body movement, enables you to connect to all parts of your body,"}, {"timestamp": "94.0 - 100.0", "text": " to your emotions and to bring awareness to everything you feel, to calm the nervous system down"}, {"timestamp": "100.0 - 108.0", "text": " and to move forward in a more confident way towards your authentic being, your identity and your desired state."}, {"timestamp": "108.0 - 109.0", "text": " Thank you."}, {"timestamp": "109.0 - 115.0", "text": " In this masterclass, you will learn that the transformation process begins with centering and reconnecting with yourself,"}, {"timestamp": "115.0 - 121.0", "text": " with your body by bringing all the curiosity necessary through movement and mindfulness."}, {"timestamp": "121.0 - 126.0", "text": " Through an exploration of your body, through movement, NLP skills and music,"}, {"timestamp": "126.0 - 131.0", "text": " you will find new possibilities of being present to yourself and all worlds."}, {"timestamp": "131.0 - 137.0", "text": " I will guide you on a journey to enter in the realm of NLP Somatic Universe,"}, {"timestamp": "137.0 - 144.0", "text": " to rediscover your body, its wellness, in its ability to move, to open new expression of yourself,"}, {"timestamp": "144.0 - 146.0", "text": " in order to move forward in the world."}, {"timestamp": "146.0 - 152.0", "text": " It's a journey of self-discovery, of your own hero's journey at your own pace."}, {"timestamp": "152.0 - 157.0", "text": " I am an awakener of people's dreams and I love it. Be careful."}, {"timestamp": "157.0 - 164.0", "text": " My presentation will include generative NLP, some movements with music, the importance of somatic mind"}, {"timestamp": "164.0 - 167.0", "text": " and how it can change your internal and external world."}, {"timestamp": "167.0 - 171.0", "text": " So, are you ready to move and reconnect yourself to your body?"}, {"timestamp": "171.0 - 176.0", "text": " I wish to have the chance to see you at the NLP International Council."}, {"timestamp": "176.0 - 178.0", "text": " Bye-bye NLP community!"}]}
{"audio_title": "What makes Clean Language ‘clean’ - Penny Tompkins & James Lawley [P3icxlpgPhE].mp3", "audio_text": " David Grove used to say all questions are up to something. The distinction between leading and clean questions is they are up to different things. The vast majority of questions people ask whether in everyday conversation or in a professional setting are leading. A new book, Clean Language Interviewing, goes into great detail about the difference between the two types of question. David Grove spent 25 years looking for clean non-leading questions. In all that time he found less than a dozen that are universally clean. That is, they can be asked in almost any context including therapy and coaching. So what makes a clean language question clean? And why are there so few of them? Despite what followers of Carl Rogers might think, there's no such thing as a non-directive question. All questions are directive, even clean language questions, in that every question invites the client to consider one thing rather than another. Clean language questions operate at a process level. They do not introduce any content, they only incorporate the information that's already been supplied by the client using their exact words. All the other words in the question are process words that are short, simple, and relate to fundamental ideas about space, time, and matter. The reason there are so few questions that meet this criteria is because there is a surprisingly small number of universal concepts that exist in every language studied so far. These universal concepts are called semantic primes and they form the basis of the classic clean language language questions such as, and is there anything else about, and what kind of is that, and where is. But there's more to a clean language question than the words. There's also the purpose or intention of a clean question and the way it is asked. Clean language questions are designed to send a client on a quest for self-knowledge. We call this the client self-modeling. Even when a facilitator feels they need to know the answer to a question, clean language questions are designed so that the client discovers the information for themselves first, and only then, if they wish, shares it with the facilitator. As David Grove used to say, clean language is deeply agreeable to the client's heart and soul. A list of the commonly asked clean questions, including translations in over 20 languages, are freely available on our website cleanlanguage.com. We'd love to have you join us at our Masterclass. Thank you. Thank you. Thank you. Thank you. Thank you. We'll see you next time. We'd love to have you join us at our Masterclass.", "segments": [{"timestamp": "0.0 - 17.240000000000002", "text": " David Grove used to say all questions are up to something. The distinction between leading and"}, {"timestamp": "17.240000000000002 - 24.68", "text": " clean questions is they are up to different things. The vast majority of questions people"}, {"timestamp": "24.68 - 33.08", "text": " ask whether in everyday conversation or in a professional setting are leading. A new book,"}, {"timestamp": "33.08 - 39.86", "text": " Clean Language Interviewing, goes into great detail about the difference between the two types of"}, {"timestamp": "39.86 - 50.56", "text": " question. David Grove spent 25 years looking for clean non-leading questions. In all that time he"}, {"timestamp": "50.56 - 59.620000000000005", "text": " found less than a dozen that are universally clean. That is, they can be asked in almost any context"}, {"timestamp": "59.620000000000005 - 69.18", "text": " including therapy and coaching. So what makes a clean language question clean? And why are there"}, {"timestamp": "69.18 - 77.06", "text": " so few of them? Despite what followers of Carl Rogers might think, there's no such thing as a"}, {"timestamp": "77.06 - 83.74000000000001", "text": " non-directive question. All questions are directive, even clean language questions,"}, {"timestamp": "83.74000000000001 - 92.10000000000001", "text": " in that every question invites the client to consider one thing rather than another. Clean"}, {"timestamp": "92.10000000000001 - 101.12", "text": " language questions operate at a process level. They do not introduce any content, they only incorporate"}, {"timestamp": "101.12 - 109.7", "text": " the information that's already been supplied by the client using their exact words. All the other"}, {"timestamp": "109.7 - 118.22", "text": " words in the question are process words that are short, simple, and relate to fundamental ideas about space,"}, {"timestamp": "118.22 - 126.84", "text": " time, and matter. The reason there are so few questions that meet this criteria is because there is a"}, {"timestamp": "126.84 - 134.92000000000002", "text": " surprisingly small number of universal concepts that exist in every language studied so far."}, {"timestamp": "134.92000000000002 - 145.08", "text": " These universal concepts are called semantic primes and they form the basis of the classic clean language"}, {"timestamp": "145.08 - 163.56", "text": " language questions such as, and is there anything else about, and what kind of is that, and where is."}, {"timestamp": "163.56 - 173.08", "text": " But there's more to a clean language question than the words. There's also the purpose or intention of a clean question and the way it is asked."}, {"timestamp": "173.08 - 184.84", "text": " Clean language questions are designed to send a client on a quest for self-knowledge. We call this the client self-modeling."}, {"timestamp": "186.04000000000002 - 202.84", "text": " Even when a facilitator feels they need to know the answer to a question, clean language questions are designed so that the client discovers the information for themselves first, and only then, if they wish, shares it with the facilitator."}, {"timestamp": "203.08 - 213.72000000000003", "text": " As David Grove used to say, clean language is deeply agreeable to the client's heart and soul."}, {"timestamp": "213.72000000000003 - 227.60000000000002", "text": " A list of the commonly asked clean questions, including translations in over 20 languages, are freely available on our website cleanlanguage.com."}, {"timestamp": "227.6 - 231.51999999999998", "text": " We'd love to have you join us at our Masterclass."}, {"timestamp": "231.51999999999998 - 232.07999999999998", "text": " Thank you."}, {"timestamp": "232.07999999999998 - 232.96", "text": " Thank you."}, {"timestamp": "232.96 - 233.16", "text": " Thank you."}, {"timestamp": "233.16 - 233.9", "text": " Thank you."}, {"timestamp": "233.9 - 235.92", "text": " Thank you."}, {"timestamp": "235.92 - 237.98", "text": " We'll see you next time."}, {"timestamp": "237.98 - 240.35999999999999", "text": " We'd love to have you join us at our Masterclass."}]}
{"audio_title": "2023 NLP International Conference -  Cat Trebilco - Session Taster Video [eJU72ZIXeXs].mp3", "audio_text": " Hi, I'm Kat Trabilco and I'm an NLP trainer and a coach and specifically I specialise in outdoor coaching. Now today just because of the wind I'm hiding out in the greenhouse but I wanted to ask you the question, have you ever thought about taking your coaching practice into the outdoors? Have you ever thought about getting high during a coaching practice? Now fear not, I'm not talking anything to do with drugs, I'm talking about quite literally getting high, getting high up and getting some kind of view where you can see a big expansive perspective in front of you and how you can use that with clients to help bring some enlightenment or problem solving or just quite literally to get a different perspective. So during the session I'm going to be looking at the benefits of taking coaching outside and that's benefits both for you as the coach and also the benefits for the clients. I'm going to be exploring some of the science around why it works, what does being out in nature do for us, how does it enhance our problem solving skills, how does it enhance our connection with ourselves and some of the other things that being in the outdoors can help you with. I'm also then going to look at the practicalities of taking your coaching into the outdoors. Common things that come up are challenges with the weather, how you can take notes and things like fitness levels as well. And then I'm going to be exploring two things in more detail in the session. One is around metaphors and our use of metaphors. Now coaching metaphors are really rich and so many of them are nature based. Things like can't see the wood for the trees or the sun always shines above the clouds when you're stuck in the clouds at that moment in time. Also things like weathering the storm. So how can you use these metaphors to enrich a coaching session by actually taking someone out into their metaphor? So how could you look at how a tree system or different animals are weathering a storm and is there anything you can learn from that? You know, when we talk about getting a different perspective and this is where the getting high comes in. How can you get high up and quite literally get a different perspective on something? Can you put your problem down in a valley and look at it from above or look past it or around it and see some other elements that are going on in the situation? And then finally, I'm going to be sharing with you a new tool called the decision making compass and how this can help clients who are exploring maybe two different pathways that they can take and how quite literally you can take them out to two different pathways and help them make a decision where they've got one option or another to choose from. So let me ask you again, have you ever thought about taking your coaching practice outside? Come along to the session and together like a bunch of adventurers, we can explore the topic a little further. So you have said All in talk about your coaching practice though, speaking about taking your coaching practice outside of the session, we do not d", "segments": [{"timestamp": "0.0 - 12.0", "text": " Hi, I'm Kat Trabilco and I'm an NLP trainer and a coach and specifically I specialise in outdoor coaching."}, {"timestamp": "12.0 - 17.0", "text": " Now today just because of the wind I'm hiding out in the greenhouse but I wanted to ask you the question,"}, {"timestamp": "17.0 - 21.0", "text": " have you ever thought about taking your coaching practice into the outdoors?"}, {"timestamp": "21.0 - 25.0", "text": " Have you ever thought about getting high during a coaching practice?"}, {"timestamp": "25.0 - 31.0", "text": " Now fear not, I'm not talking anything to do with drugs, I'm talking about quite literally getting high,"}, {"timestamp": "31.0 - 37.0", "text": " getting high up and getting some kind of view where you can see a big expansive perspective in front of you"}, {"timestamp": "37.0 - 47.0", "text": " and how you can use that with clients to help bring some enlightenment or problem solving or just quite literally to get a different perspective."}, {"timestamp": "47.0 - 52.0", "text": " So during the session I'm going to be looking at the benefits of taking coaching outside"}, {"timestamp": "52.0 - 57.0", "text": " and that's benefits both for you as the coach and also the benefits for the clients."}, {"timestamp": "57.0 - 64.0", "text": " I'm going to be exploring some of the science around why it works, what does being out in nature do for us,"}, {"timestamp": "64.0 - 70.0", "text": " how does it enhance our problem solving skills, how does it enhance our connection with ourselves"}, {"timestamp": "70.0 - 74.0", "text": " and some of the other things that being in the outdoors can help you with."}, {"timestamp": "74.0 - 79.0", "text": " I'm also then going to look at the practicalities of taking your coaching into the outdoors."}, {"timestamp": "79.0 - 86.0", "text": " Common things that come up are challenges with the weather, how you can take notes and things like fitness levels as well."}, {"timestamp": "86.0 - 90.0", "text": " And then I'm going to be exploring two things in more detail in the session."}, {"timestamp": "90.0 - 93.0", "text": " One is around metaphors and our use of metaphors."}, {"timestamp": "93.0 - 98.0", "text": " Now coaching metaphors are really rich and so many of them are nature based."}, {"timestamp": "98.0 - 107.0", "text": " Things like can't see the wood for the trees or the sun always shines above the clouds when you're stuck in the clouds at that moment in time."}, {"timestamp": "107.0 - 117.0", "text": " Also things like weathering the storm. So how can you use these metaphors to enrich a coaching session by actually taking someone out into their metaphor?"}, {"timestamp": "117.0 - 125.0", "text": " So how could you look at how a tree system or different animals are weathering a storm and is there anything you can learn from that?"}, {"timestamp": "125.0 - 130.0", "text": " You know, when we talk about getting a different perspective and this is where the getting high comes in."}, {"timestamp": "130.0 - 135.0", "text": " How can you get high up and quite literally get a different perspective on something?"}, {"timestamp": "135.0 - 144.0", "text": " Can you put your problem down in a valley and look at it from above or look past it or around it and see some other elements that are going on in the situation?"}, {"timestamp": "144.0 - 165.0", "text": " And then finally, I'm going to be sharing with you a new tool called the decision making compass and how this can help clients who are exploring maybe two different pathways that they can take and how quite literally you can take them out to two different pathways and help them make a decision where they've got one option or another to choose from."}, {"timestamp": "165.0 - 178.0", "text": " So let me ask you again, have you ever thought about taking your coaching practice outside? Come along to the session and together like a bunch of adventurers, we can explore the topic a little further."}, {"timestamp": "178.0 - 183.04", "text": " So you have said"}, {"timestamp": "183.14 - 207.56", "text": " All in talk about your coaching practice though, speaking about taking your coaching practice outside of the session, we do not d"}]}
{"audio_title": "How Do You Ask a Clean Language Question - Penny Tompkins & James Lawley [4f2073Kx4KA].mp3", "audio_text": " In the early days of modelling David Grove, Penny and I attended every workshop he did when he was in the UK. They were usually residential, so we had a lot of access to him. The more we showed up, the more he realised just how serious we were about getting good at using his method. One day, David overheard Penny practising asking clean language questions with another participant. That evening, he asked her if she would like to do some practice with him. Who's going to say no to that? David and I stood up about ten feet, three metres apart, facing each other. Then he said, go on, ask me a question. So I asked him, and what would you like to have happen? He said, where do you think that question landed? Well, probably over there, I said, waving my hand in his general direction. No, he said, that question fell somewhere in the space between us. It never reached me. Ask it again, only this time with oomph. And he added, if you don't got oomph, you don't got it. So I had another go. David also said, once I could deliver a question with oomph, I needed to pay attention to where my question landed in the client's perceptual space. To do this, I needed to know where the client perceived their symbols to be in their space and to deliver my question to that particular space. Again, practice was needed. And when I finally got it, it was like I was an archer that could fire an arrow and hit the bullseye. This taught me that my attention needed to be over there in the client's metaphor landscape. Learning to deliver questions like this transformed the effectiveness of every future clean language question I ever asked. So, instead of thinking, what question should I ask next? We first wonder what and where in the metaphor landscape would it be useful for the client to attend to? Once we know that, choosing the appropriate clean language question is easy. So join us for our masterclass at the NLP conference in London and discover more nuggets about how to skillfully use clean language questions and symbolic modelling.", "segments": [{"timestamp": "0.0 - 17.34", "text": " In the early days of modelling David Grove, Penny and I attended every workshop he did when he was in the UK."}, {"timestamp": "18.16 - 22.96", "text": " They were usually residential, so we had a lot of access to him."}, {"timestamp": "22.96 - 30.900000000000002", "text": " The more we showed up, the more he realised just how serious we were about getting good at using his method."}, {"timestamp": "31.840000000000003 - 38.68", "text": " One day, David overheard Penny practising asking clean language questions with another participant."}, {"timestamp": "39.68 - 44.38", "text": " That evening, he asked her if she would like to do some practice with him."}, {"timestamp": "45.66 - 47.14", "text": " Who's going to say no to that?"}, {"timestamp": "47.14 - 54.38", "text": " David and I stood up about ten feet, three metres apart, facing each other."}, {"timestamp": "55.16 - 58.5", "text": " Then he said, go on, ask me a question."}, {"timestamp": "59.36 - 63.04", "text": " So I asked him, and what would you like to have happen?"}, {"timestamp": "64.3 - 68.14", "text": " He said, where do you think that question landed?"}, {"timestamp": "69.36 - 74.76", "text": " Well, probably over there, I said, waving my hand in his general direction."}, {"timestamp": "74.76 - 81.96000000000001", "text": " No, he said, that question fell somewhere in the space between us."}, {"timestamp": "82.38000000000001 - 84.32000000000001", "text": " It never reached me."}, {"timestamp": "85.0 - 88.4", "text": " Ask it again, only this time with oomph."}, {"timestamp": "89.2 - 93.66000000000001", "text": " And he added, if you don't got oomph, you don't got it."}, {"timestamp": "94.88000000000001 - 96.7", "text": " So I had another go."}, {"timestamp": "96.7 - 121.78", "text": " David also said, once I could deliver a question with oomph, I needed to pay attention to where my question landed in the client's perceptual space."}, {"timestamp": "121.78 - 136.24", "text": " To do this, I needed to know where the client perceived their symbols to be in their space and to deliver my question to that particular space."}, {"timestamp": "136.8 - 138.82", "text": " Again, practice was needed."}, {"timestamp": "139.34 - 147.2", "text": " And when I finally got it, it was like I was an archer that could fire an arrow and hit the bullseye."}, {"timestamp": "147.2 - 155.64", "text": " This taught me that my attention needed to be over there in the client's metaphor landscape."}, {"timestamp": "156.85999999999999 - 167.01999999999998", "text": " Learning to deliver questions like this transformed the effectiveness of every future clean language question I ever asked."}, {"timestamp": "167.02 - 172.38000000000002", "text": " So, instead of thinking, what question should I ask next?"}, {"timestamp": "173.04000000000002 - 181.96", "text": " We first wonder what and where in the metaphor landscape would it be useful for the client to attend to?"}, {"timestamp": "182.32000000000002 - 187.22", "text": " Once we know that, choosing the appropriate clean language question is easy."}, {"timestamp": "187.22 - 201.52", "text": " So join us for our masterclass at the NLP conference in London and discover more nuggets about how to skillfully use clean language questions and symbolic modelling."}]}
